Revit 2024 API
IEntryPoint.AddinFolder Property
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
string AddinFolder { get; }
Visual Basic
ReadOnly Property AddinFolder As String
	Get
Visual C++
property String^ AddinFolder {
	String^ get ();
}
See Also
IEntryPoint Interface
Autodesk.Revit.DB.Macros Namespace